# Тема 2

Таблица соответствия логических операций
<table class="docutils align-default">
    <thead>
        <tr class="row-odd">
            <th class="head">Операция</th>
            <th class="head">Альтернатива в Python</th>
        </tr>
    </thead>
    <tbody>
        <tr class="row-even"><td><code>→</code></td><td><code><=</code></td></tr>
        <tr class="row-even"><td><code>≡</code></td><td><code>==</code></td></tr>
        <tr class="row-even"><td><code>∨</code></td><td><code>or</code></td></tr>
        <tr class="row-even"><td><code>∧</code></td><td><code>and</code></td></tr>
        <tr class="row-even"><td><code>¬</code></td><td><code>not</code></td></tr>
    </tbody>
</table>

### Пример решения задания I способ

Логическая функция F задаётся выражением 
<p>(¬z ≡ y) → ((w ∧ ¬x) ≡ (y ∧ x))</p>
Ниже приведён частично заполненный фрагмент таблицы истинности функции F,
содержащий неповторяющиеся строки. Определите, какому столбцу таблицы истинности функции F
соответствует каждая из переменных x, y, z, w.

<table class="docutils align-default ege-2">
    <thead>
        <tr class="row-odd">
            <th class="head"></th>
            <th class="head"></th>
            <th class="head"></th>
            <th class="head"></th>
            <th class="head">f</th>
        </tr>
    </thead>
    <tbody>
        <tr class="row-even"><td> </td><td>1</td><td>1</td><td>1</td><td>0</td></tr>
        <tr class="row-even"><td>1</td><td>1</td><td> </td><td> </td><td>0</td></tr>
        <tr class="row-even"><td> </td><td> </td><td>0</td><td> </td><td>0</td></tr>
    </tbody>
</table>

Ответ: zwxy

```python
print('x y z w')
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                # Важный момент! Т.к. функция возвращает 0 в условии задачи, то всё выражение помещаем под not
                if not((not(z) == y) <= ((w and not(x)) == (y and x))):
                    print(x, y, z, w)
```

Программа выведет таблицу:\
x y z w\
0 0 1 1\
0 1 0 1\
1 1 0 0\
1 1 0 1

TODO: Пояснить результат!


### Пример решения с получением готового ответа


```python
from itertools import product, permutations


def f1(x, y, z, w):
    return 1 if (not (z) == y) <= ((w and not (x)) == (y and x)) else 0


for a0, a1, a2, a3, a4, a5 in product((0, 1), repeat=6):
    s = [(a0, 1, 1, 1, 0),
         (1, 1, a1, a2, 0),
         (a3, a4, 0, a5, 0)]
    if len(set(s)) == len(s):
        for x, y, z, w in permutations((0, 1, 2, 3)):
            if all([f1(i[x], i[y], i[z], i[w]) == i[-1] for i in s]):
                print(f'x = {x + 1}; y = {y + 1}; z = {z + 1}; w = {w + 1}')
                break
```
